HydroCycloneModelling_UWO/OpenFoam-11_cases/realKE/realKE+kBuoyCurvS+eBuoy/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;
ScT             0.07;
RAS
{
    model realizableKE_BCS;
    //model    buoyantKEpsilon;

    turbulence      on;
    printCoeffs     off;
        realizableKE_BCSCoeffs
    {
        A0                  4.0;
        C2                  1.92;
        sigmak              1.0;
        sigmaEps            1.3;

        curvatureCorrection true;
        swirlCorrection     true;
        buoyancyCorrection  false;

        axisOrigin          (0 0 0);
        axisDirection       (0 0 1);

        S0                  0.2;
        S1                  0.8;
        frMax               1.25;
        swirlEps            1e-6;
        Cg                  1.0;

        writeFields         false;
    }

     Optional model coefficieints
    Cmu             0.09;
    C1              1.44;
    C2              1.92;
    C3              0.0;
    sigmak          1.0;
    sigmaEps        1.3;

}



// ************************************************************************* //
